[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:189:34
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
 
-        var tasksDirectoryInfo = directoryInfos.Length > 0
+        var tasksDirectoryInfo = directoryInfos.Length < 0
             ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
             : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Conditional (false) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:189:34
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
 
-        var tasksDirectoryInfo = directoryInfos.Length > 0
-            ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
-            : Enumerable.Empty<Task>();
+        var tasksDirectoryInfo = (false?directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
+:Enumerable.Empty<Task>());
 
         await Task.WhenAll(tasksFile.Concat(tasksDirectoryInfo));
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:231:29
                 : Enumerable.Empty<Task>();
 
             // 创建删除文件的任务，仅当文件不为空时
-            var fileTasks = files.Length > 0
+            var fileTasks = files.Length >= 0
                 ? files.Select(file => TryDeleteFileAsync(file))
                 : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously
