[Killed] Conditional (false) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:185:25
         FileInfo[] fileInfos = di.GetFiles("*.*");
         DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
 
-        var tasksFile = fileInfos.Length > 0
-            ? fileInfos.Select(file => TryDeleteFileAsync(file))
-            : Enumerable.Empty<Task>();
+        var tasksFile = (false?fileInfos.Select(file => TryDeleteFileAsync(file))
+:Enumerable.Empty<Task>());
 
         var tasksDirectoryInfo = directoryInfos.Length > 0
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously
