[Killed] Block removal mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:10:5
     private readonly IGetTempFolderPathHelper _getTempFolderPathHelper;
 
     public CleanDirectoryHelper(IGetTempFolderPathHelper getTempFolderPathHelper)
-    {
-        this._getTempFolderPathHelper = getTempFolderPathHelper;
-    }
+    {}
 
     private bool GetDirectory(out DirectoryInfo? di)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNull_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Negate expression
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:18:13
     {
         string directoryPath = _getTempFolderPathHelper.GetTempFolderPath();
 
-        if (string.IsNullOrWhiteSpace(directoryPath))
+        if (!(string.IsNullOrWhiteSpace(directoryPath)))
         {
             throw new ArgumentException("Directory path is empty");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNull_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:18:13
     {
         string directoryPath = _getTempFolderPathHelper.GetTempFolderPath();
 
-        if (string.IsNullOrWhiteSpace(directoryPath))
+        if ((directoryPath!=null))
         {
             throw new ArgumentException("Directory path is empty");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:20:13
 
         if (string.IsNullOrWhiteSpace(directoryPath))
         {
-            throw new ArgumentException("Directory path is empty");
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNull_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNull

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:23:13
             throw new ArgumentException("Directory path is empty");
         }
 
-        if (!Directory.Exists(directoryPath))
+        if (Directory.Exists(directoryPath))
         {
             throw new DirectoryNotFoundException("Directory path does not exist");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:25:13
 
         if (!Directory.Exists(directoryPath))
         {
-            throw new DirectoryNotFoundException("Directory path does not exist");
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNotExistPath_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleArgumentException_WhenGetTempFolderPathReturnNotExistPath

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:31:17
         di = new DirectoryInfo(directoryPath);
         try
         {
-            if (!di.Exists)
+            if (di.Exists)
             {
                 Console.WriteLine("Directory does not exist.");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:33:17
         {
             if (!di.Exists)
             {
-                Console.WriteLine("Directory does not exist.");
+                ;
             }
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:39:13
         catch (ArgumentException ex)
         {
             // 路径格式不正确
-            Console.WriteLine("ArgumentException: " + ex.Message);
+            ;
             di = null;
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:39:31
         catch (ArgumentException ex)
         {
             // 路径格式不正确
-            Console.WriteLine("ArgumentException: " + ex.Message);
+            Console.WriteLine("" + ex.Message);
             di = null;
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:45:13
         catch (PathTooLongException ex)
         {
             // 路径太长
-            Console.WriteLine("PathTooLongException: " + ex.Message);
+            ;
             di = null;
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:45:31
         catch (PathTooLongException ex)
         {
             // 路径太长
-            Console.WriteLine("PathTooLongException: " + ex.Message);
+            Console.WriteLine("" + ex.Message);
             di = null;
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:51:13
         catch (UnauthorizedAccessException ex)
         {
             // 没有权限访问路径
-            Console.WriteLine("UnauthorizedAccessException: " + ex.Message);
+            ;
             di = null;
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:62:13
         catch (Exception ex)
         {
             // 其他类型的异常
-            Console.WriteLine("An unexpected exception occurred: " + ex.Message);
+            ;
             di = null;
         }

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:66:16
             di = null;
         }
 
-        return di != null;
+        return di == null;
     }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:73:13
 
     public void CleanDirectory()
     {
-        if (!GetDirectory(out var di)) return;
+        if (GetDirectory(out var di)) return;
 
         if (di == null)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:73:40
 
     public void CleanDirectory()
     {
-        if (!GetDirectory(out var di)) return;
+        if (!GetDirectory(out var di)) ;
 
         if (di == null)

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:75:13
     {
         if (!GetDirectory(out var di)) return;
 
-        if (di == null)
+        if (di != null)
         {
             return;
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:77:13
 
         if (di == null)
         {
-            return;
+            ;
         }
 

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:83:13
         FileInfo[] fileInfos = di.GetFiles("*.*");
         foreach (var file in fileInfos)
         {
-            TryDeleteFile(file);
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles

[Killed] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:86:60
             TryDeleteFile(file);
         }
 
-        DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
+        DirectoryInfo[] directoryInfos = di.GetDirectories("");
 
         foreach (DirectoryInfo? directoryInfo in directoryInfos)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:90:13
 
         foreach (DirectoryInfo? directoryInfo in directoryInfos)
         {
-            TryDeleteDirectory(directoryInfo);
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:95:13
 
         try
         {
-            di.Delete();
+            ;
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:99:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            Console.WriteLine($"No permission to delete directory: {di.FullName} - {ex.Message}");
+            ;
         }
         catch (IOException ex)

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:103:13
         }
         catch (IOException ex)
         {
-            Console.WriteLine($"Directory in use or other IO error: {di.FullName} - {ex.Message}");
+            ;
         }
         catch (Exception ex)

[Survived] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:103:31
         }
         catch (IOException ex)
         {
-            Console.WriteLine($"Directory in use or other IO error: {di.FullName} - {ex.Message}");
+            Console.WriteLine($"");
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:107:13
         }
         catch (Exception ex)
         {
-            Console.WriteLine($"Error deleting directory: {di.FullName} - {ex.Message}");
+            ;
         }
     }

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:115:13
     {
         try
         {
-            file.Delete();
+            ;
             Console.WriteLine($"Deleted file: {file.FullName}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:116:13
         try
         {
             file.Delete();
-            Console.WriteLine($"Deleted file: {file.FullName}");
+            ;
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:120:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            Console.WriteLine($"No permission to delete file: {file.FullName} - {ex.Message}");
+            ;
         }
         catch (IOException ex)

[Survived] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:120:31
         }
         catch (UnauthorizedAccessException ex)
         {
-            Console.WriteLine($"No permission to delete file: {file.FullName} - {ex.Message}");
+            Console.WriteLine($"");
         }
         catch (IOException ex)

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:124:13
         }
         catch (IOException ex)
         {
-            Console.WriteLine($"File in use or other IO error: {file.FullName} - {ex.Message}");
+            ;
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:128:13
         }
         catch (Exception ex)
         {
-            Console.WriteLine($"Error deleting file: {file.FullName} - {ex.Message}");
+            ;
         }
     }

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:137:17
         try
         {
             // 递归删除子目录
-            if (dir.GetDirectories().Length > 0)
+            if (dir.GetDirectories().Length < 0)
             {
                 foreach (DirectoryInfo subDir in dir.GetDirectories())
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Negate expression
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:137:17
         try
         {
             // 递归删除子目录
-            if (dir.GetDirectories().Length > 0)
+            if (!(dir.GetDirectories().Length > 0))
             {
                 foreach (DirectoryInfo subDir in dir.GetDirectories())
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:141:21
             {
                 foreach (DirectoryInfo subDir in dir.GetDirectories())
                 {
-                    TryDeleteDirectory(subDir);
+                    ;
                 }
             }

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:152:13
             }
 
             // 删除目录
-            dir.Delete(true);
+            ;
             Console.WriteLine($"Deleted directory: {dir.FullName}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Boolean mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:152:24
             }
 
             // 删除目录
-            dir.Delete(true);
+            dir.Delete(false);
             Console.WriteLine($"Deleted directory: {dir.FullName}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:153:13
 
             // 删除目录
             dir.Delete(true);
-            Console.WriteLine($"Deleted directory: {dir.FullName}");
+            ;
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[Survived] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:153:31
 
             // 删除目录
             dir.Delete(true);
-            Console.WriteLine($"Deleted directory: {dir.FullName}");
+            Console.WriteLine($"");
         }
         catch (UnauthorizedAccessException ex)

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:157:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            Console.WriteLine($"No permission to delete directory: {dir.FullName} - {ex.Message}");
+            ;
         }
         catch (IOException ex)

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:161:13
         }
         catch (IOException ex)
         {
-            Console.WriteLine($"Directory in use or other IO error: {dir.FullName} - {ex.Message}");
+            ;
         }
         catch (Exception ex)

[Survived] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:161:31
         }
         catch (IOException ex)
         {
-            Console.WriteLine($"Directory in use or other IO error: {dir.FullName} - {ex.Message}");
+            Console.WriteLine($"");
         }
         catch (Exception ex)

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:165:13
         }
         catch (Exception ex)
         {
-            Console.WriteLine($"Error deleting directory: {dir.FullName} - {ex.Message}");
+            ;
         }
     }

[Survived] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:182:44
             return;
         }
 
-        FileInfo[] fileInfos = di.GetFiles("*.*");
+        FileInfo[] fileInfos = di.GetFiles("");
         DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
 

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:185:25
         FileInfo[] fileInfos = di.GetFiles("*.*");
         DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
 
-        var tasksFile = fileInfos.Length > 0
+        var tasksFile = fileInfos.Length >= 0
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:185:25
         FileInfo[] fileInfos = di.GetFiles("*.*");
         DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
 
-        var tasksFile = fileInfos.Length > 0
+        var tasksFile = fileInfos.Length < 0
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Conditional (true) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:189:34
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
 
-        var tasksDirectoryInfo = directoryInfos.Length > 0
-            ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
-            : Enumerable.Empty<Task>();
+        var tasksDirectoryInfo = (true?directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
+:Enumerable.Empty<Task>());
 
         await Task.WhenAll(tasksFile.Concat(tasksDirectoryInfo));
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:189:34
             ? fileInfos.Select(file => TryDeleteFileAsync(file))
             : Enumerable.Empty<Task>();
 
-        var tasksDirectoryInfo = directoryInfos.Length > 0
+        var tasksDirectoryInfo = directoryInfos.Length >= 0
             ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
             : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:193:9
             ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
             : Enumerable.Empty<Task>();
 
-        await Task.WhenAll(tasksFile.Concat(tasksDirectoryInfo));
+        ;
 
         try
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Linq method mutation (Concat() to Except())
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:193:28
             ? directoryInfos.Select(directoryInfo => TryDeleteDirectoryAsync(directoryInfo))
             : Enumerable.Empty<Task>();
 
-        await Task.WhenAll(tasksFile.Concat(tasksDirectoryInfo));
+        await Task.WhenAll(tasksFile.Except(tasksDirectoryInfo));
 
         try
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:209:31
         }
         catch (Exception ex)
         {
-            Console.WriteLine($"Error deleting directory: {di.FullName} - {ex.Message}");
+            Console.WriteLine($"");
         }
     }

[Killed] Block removal mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:214:5
     }
 
     private Task TryDeleteFileAsync(FileInfo file)
-    {
-        return Task.Run((() => TryDeleteFile(file)));
-    }
+    {}
 
     private async Task TryDeleteDirectoryAsync(DirectoryInfo dir)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Survived] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:226:31
             FileInfo[] files = dir.GetFiles();
 
             // 创建删除子目录的任务，仅当子目录不为空时
-            var subDirTasks = directories.Length > 0
+            var subDirTasks = directories.Length < 0
                 ? directories.Select(subDir => TryDeleteDirectoryAsync(subDir))
                 : Enumerable.Empty<Task>();

[Survived] Conditional (false) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:226:31
             FileInfo[] files = dir.GetFiles();
 
             // 创建删除子目录的任务，仅当子目录不为空时
-            var subDirTasks = directories.Length > 0
-                ? directories.Select(subDir => TryDeleteDirectoryAsync(subDir))
-                : Enumerable.Empty<Task>();
+            var subDirTasks = (false?directories.Select(subDir => TryDeleteDirectoryAsync(subDir))
+:Enumerable.Empty<Task>());
 
             // 创建删除文件的任务，仅当文件不为空时

[Killed] Conditional (false) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:231:29
                 : Enumerable.Empty<Task>();
 
             // 创建删除文件的任务，仅当文件不为空时
-            var fileTasks = files.Length > 0
-                ? files.Select(file => TryDeleteFileAsync(file))
-                : Enumerable.Empty<Task>();
+            var fileTasks = (false?files.Select(file => TryDeleteFileAsync(file))
+:Enumerable.Empty<Task>());
 
             // 同时删除文件和子目录
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Survived] Conditional (true) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:231:29
                 : Enumerable.Empty<Task>();
 
             // 创建删除文件的任务，仅当文件不为空时
-            var fileTasks = files.Length > 0
-                ? files.Select(file => TryDeleteFileAsync(file))
-                : Enumerable.Empty<Task>();
+            var fileTasks = (true?files.Select(file => TryDeleteFileAsync(file))
+:Enumerable.Empty<Task>());
 
             // 同时删除文件和子目录

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:236:13
                 : Enumerable.Empty<Task>();
 
             // 同时删除文件和子目录
-            await Task.WhenAll(fileTasks);
+            ;
             await Task.WhenAll(subDirTasks);
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:237:13
 
             // 同时删除文件和子目录
             await Task.WhenAll(fileTasks);
-            await Task.WhenAll(subDirTasks);
+            ;
 
             dir.Delete(true);

[Killed] Boolean mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:239:24
             await Task.WhenAll(fileTasks);
             await Task.WhenAll(subDirTasks);
 
-            dir.Delete(true);
+            dir.Delete(false);
 
             Console.WriteLine($"Deleted directory: {dir.FullName}");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously
