[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:239:13
             await Task.WhenAll(fileTasks);
             await Task.WhenAll(subDirTasks);
 
-            dir.Delete(true);
+            ;
 
             Console.WriteLine($"Deleted directory: {dir.FullName}");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:241:13
 
             dir.Delete(true);
 
-            Console.WriteLine($"Deleted directory: {dir.FullName}");
+            ;
         }
         catch (UnauthorizedAccessException ex)

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:253:31
         }
         catch (Exception ex)
         {
-            Console.WriteLine($"Error deleting directory: {dir.FullName} - {ex.Message}");
+            Console.WriteLine($"");
         }
     }
