[NoCoverage] String mutation
CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/Exceptions/GetTempFolderPathHelperException.cs:5:54
 
 public class GetTempFolderPathHelperException : Exception
 {
-    public GetTempFolderPathHelperException() : base("Get Temp Folder Path fail")
+    public GetTempFolderPathHelperException() : base("")
     {
     }
