[Killed] Block removal mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/GetTempFolderPathHelper.cs:11:5
     private readonly ITempFolderPathProvider _tempFolderPathProvider;
 
     public GetTempFolderPathHelper(ITempFolderPathProvider provider)
-    {
-        this._tempFolderPathProvider = provider;
-    }
+    {}
 
     public string GetTempFolderPath()
killedBy: CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldReturnTempPath_WhenCalled; CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNull; CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNotExists

[Killed] Equality mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/GetTempFolderPathHelper.cs:19:25
     {
         string? tempPath = _tempFolderPathProvider.TempFolderPathProvider();
 
-        if (tempPath is null)
+        if (tempPath is not null)
         {
             throw new GetTempFolderPathHelperException("Could not get temp folder path");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldReturnTempPath_WhenCalled; CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNull; CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNotExists

[Killed] Statement mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/GetTempFolderPathHelper.cs:21:13
 
         if (tempPath is null)
         {
-            throw new GetTempFolderPathHelperException("Could not get temp folder path");
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNull

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/GetTempFolderPathHelper.cs:24:13
             throw new GetTempFolderPathHelperException("Could not get temp folder path");
         }
 
-        if (!Directory.Exists(tempPath))
+        if (Directory.Exists(tempPath))
         {
             throw new GetTempFolderPathHelperException("The temp folder path does not exist");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldReturnTempPath_WhenCalled; CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNotExists

[Killed] Statement mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/GetTempFolderPathHelper.cs:26:13
 
         if (!Directory.Exists(tempPath))
         {
-            throw new GetTempFolderPathHelperException("The temp folder path does not exist");
+            ;
         }
 
killedBy: CleanTempAsync.Core.UnitTests.Helpers.GetTempFolderPathHelperTests.GetTempFolderPathHelperShould.GetTempFolderPath_ShouldThrowException_WhenDirectoryNameIsNotExists
