[NoCoverage] Statement mutation
CleanTempAsync.Core/Helpers/ImplementationClassLists/TempFolderPathProviderImpl.cs:11:9
     {
         string tempFileName = Path.GetTempFileName();
         string? tempPath = Path.GetDirectoryName(tempFileName);
-        File.Delete(tempFileName); // 删除临时文件，只保留路径
+        ; // 删除临时文件，只保留路径
         return tempPath;
     }
