[Killed] Block removal mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:13:5
 
     public CleanDirectoryHelper(IGetTempFolderPathHelper getTempFolderPathHelper,
         ILoggerService<CleanDirectoryHelper> logger)
-    {
-        this._getTempFolderPathHelper = getTempFolderPathHelper;
-        this._logger = logger;
-    }
+    {}
 
     private bool GetDirectory(out DirectoryInfo? di)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:24:13
 
         if (string.IsNullOrWhiteSpace(directoryPath))
         {
-            _logger.LogError(new AggregateException(), "Directory path is empty");
+            ;
             // throw new ArgumentException("Directory path is empty");
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:30:13
 
         if (!Directory.Exists(directoryPath))
         {
-            _logger.LogError(new DirectoryNotFoundException(), "Directory path does not exist");
+            ;
             // throw new DirectoryNotFoundException("Directory path does not exist");
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:39:17
         {
             if (!di.Exists)
             {
-                _logger.LogError(new AggregateException(), "Directory does not exist.");
+                ;
                 // Console.WriteLine("Directory does not exist.");
             }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:39:60
         {
             if (!di.Exists)
             {
-                _logger.LogError(new AggregateException(), "Directory does not exist.");
+                _logger.LogError(new AggregateException(), "");
                 // Console.WriteLine("Directory does not exist.");
             }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:46:13
         catch (ArgumentException ex)
         {
             // 路径格式不正确
-            _logger.LogError(ex, "The path format is incorrect");
+            ;
             // Console.WriteLine("ArgumentException: " + ex.Message);
             di = null;

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:53:13
         catch (PathTooLongException ex)
         {
             // 路径太长
-            _logger.LogError(ex, "Path too long");
+            ;
             // Console.WriteLine("PathTooLongException: " + ex.Message);
             di = null;

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:60:13
         catch (UnauthorizedAccessException ex)
         {
             // 没有权限访问路径
-            _logger.LogError(ex, "No permission to access the path");
+            ;
             // Console.WriteLine("UnauthorizedAccessException: " + ex.Message);
             di = null;

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:60:34
         catch (UnauthorizedAccessException ex)
         {
             // 没有权限访问路径
-            _logger.LogError(ex, "No permission to access the path");
+            _logger.LogError(ex, "");
             // Console.WriteLine("UnauthorizedAccessException: " + ex.Message);
             di = null;

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:72:13
         catch (Exception ex)
         {
             // 其他类型的异常 | 发生意外异常
-            _logger.LogError(ex, "An unexpected exception occurred");
+            ;
             // Console.WriteLine("An unexpected exception occurred: " + ex.Message);
             di = null;

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:72:34
         catch (Exception ex)
         {
             // 其他类型的异常 | 发生意外异常
-            _logger.LogError(ex, "An unexpected exception occurred");
+            _logger.LogError(ex, "");
             // Console.WriteLine("An unexpected exception occurred: " + ex.Message);
             di = null;

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:107:13
         try
         {
             di.Delete();
-            _logger.LogInformation($"Directory {di.FullName} deleted");
+            ;
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:111:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            _logger.LogError(ex, "No permission to delete the directory: {di.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"No permission to delete directory: {di.FullName} - {ex.Message}");
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:111:34
         }
         catch (UnauthorizedAccessException ex)
         {
-            _logger.LogError(ex, "No permission to delete the directory: {di.FullName} - {ex.Message}");
+            _logger.LogError(ex, "");
             // Console.WriteLine($"No permission to delete directory: {di.FullName} - {ex.Message}");
         }

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:116:13
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, "Directory in use or other IO error: {di.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Directory in use or other IO error: {di.FullName} - {ex.Message}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles

[Killed] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:116:34
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, "Directory in use or other IO error: {di.FullName} - {ex.Message}");
+            _logger.LogError(ex, "");
             // Console.WriteLine($"Directory in use or other IO error: {di.FullName} - {ex.Message}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:121:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, $"Error deleting directory: {di.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Error deleting directory: {di.FullName} - {ex.Message}");
         }

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:131:13
         try
         {
             file.Delete();
-            _logger.LogInformation($"Deleted file: {file.FullName}");
+            ;
             // Console.WriteLine($"Deleted file: {file.FullName}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:136:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            _logger.LogError(ex, "No permission to delete the file: {file.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"No permission to delete file: {file.FullName} - {ex.Message}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:141:13
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, $"File in use or other IO error: {file.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"File in use or other IO error: {file.FullName} - {ex.Message}");
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:141:34
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, $"File in use or other IO error: {file.FullName} - {ex.Message}");
+            _logger.LogError(ex, $"");
             // Console.WriteLine($"File in use or other IO error: {file.FullName} - {ex.Message}");
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:146:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, $"Error deleting file: {file.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Error deleting file: {file.FullName} - {ex.Message}");
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:146:34
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, $"Error deleting file: {file.FullName} - {ex.Message}");
+            _logger.LogError(ex, $"");
             // Console.WriteLine($"Error deleting file: {file.FullName} - {ex.Message}");
         }

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:156:17
         try
         {
             // 递归删除子目录
-            if (dir.GetDirectories().Length > 0)
+            if (dir.GetDirectories().Length >= 0)
             {
                 foreach (DirectoryInfo subDir in dir.GetDirectories())
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:171:13
             }
 
             // 删除目录
-            dir.Delete();
+            ;
             _logger.LogInformation($"Deleted directory: {dir.FullName}");
             // Console.WriteLine($"Deleted directory: {dir.FullName}");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:172:13
 
             // 删除目录
             dir.Delete();
-            _logger.LogInformation($"Deleted directory: {dir.FullName}");
+            ;
             // Console.WriteLine($"Deleted directory: {dir.FullName}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShould.Given_TempFolderPath_And_Clean_The_Directory

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:177:13
         }
         catch (UnauthorizedAccessException ex)
         {
-            _logger.LogError(ex, "No permission to delete the directory: {dir.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"No permission to delete directory: {dir.FullName} - {ex.Message}");
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:177:34
         }
         catch (UnauthorizedAccessException ex)
         {
-            _logger.LogError(ex, "No permission to delete the directory: {dir.FullName} - {ex.Message}");
+            _logger.LogError(ex, "");
             // Console.WriteLine($"No permission to delete directory: {dir.FullName} - {ex.Message}");
         }

[Survived] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:182:13
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, $"Directory in use or other IO error: {dir.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Directory in use or other IO error: {dir.FullName} - {ex.Message}");
         }

[NoCoverage] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:187:13
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, $"Error deleting directory: {dir.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Error deleting directory: {dir.FullName} - {ex.Message}");
         }

[NoCoverage] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:187:34
         }
         catch (Exception ex)
         {
-            _logger.LogError(ex, $"Error deleting directory: {dir.FullName} - {ex.Message}");
+            _logger.LogError(ex, $"");
             // Console.WriteLine($"Error deleting directory: {dir.FullName} - {ex.Message}");
         }

[Killed] Conditional (true) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:208:25
         FileInfo[] fileInfos = di.GetFiles("*.*");
         DirectoryInfo[] directoryInfos = di.GetDirectories("*.*");
 
-        var tasksFile = fileInfos.Length > 0
-            ? fileInfos.Select(file => TryDeleteFileAsync(file))
-            : Enumerable.Empty<Task>();
+        var tasksFile = (true?fileInfos.Select(file => TryDeleteFileAsync(file))
+:Enumerable.Empty<Task>());
 
         var tasksDirectoryInfo = directoryInfos.Length > 0
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:221:13
         try
         {
             di.Delete();
-            _logger.LogInformation($"Deleted directory: {di.FullName}");
+            ;
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] String mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:221:36
         try
         {
             di.Delete();
-            _logger.LogInformation($"Deleted directory: {di.FullName}");
+            _logger.LogInformation($"");
         }
         catch (UnauthorizedAccessException ex)
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:230:13
         }
         catch (IOException ex)
         {
-            _logger.LogError(ex, $"Directory in use or other IO error: {di.FullName} - {ex.Message}");
+            ;
             // Console.WriteLine($"Directory in use or other IO error: {di.FullName} - {ex.Message}");
         }
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleUnauthorizedAccessException_WhenDeletingFiles_Asynchronously

[Killed] Conditional (true) mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:253:31
             FileInfo[] files = dir.GetFiles();
 
             // 创建删除子目录的任务，仅当子目录不为空时
-            var subDirTasks = directories.Length > 0
-                ? directories.Select(subDir => TryDeleteDirectoryAsync(subDir))
-                : Enumerable.Empty<Task>();
+            var subDirTasks = (true?directories.Select(subDir => TryDeleteDirectoryAsync(subDir))
+:Enumerable.Empty<Task>());
 
             // 创建删除文件的任务，仅当文件不为空时
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.CleanDirectory_ShouldHandleIOException_WhenDeletingDirectories_Asynchronously; CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Equality mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:258:29
                 : Enumerable.Empty<Task>();
 
             // 创建删除文件的任务，仅当文件不为空时
-            var fileTasks = files.Length > 0
+            var fileTasks = files.Length < 0
                 ? files.Select(file => TryDeleteFileAsync(file))
                 : Enumerable.Empty<Task>();
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously

[Killed] Statement mutation
PersonalCSharpProject/CleanUpTheTempFolderAsynchronously/CleanTempAsync.Core/CleanDirectoryHelper.cs:266:13
             await Task.WhenAll(fileTasks);
             await Task.WhenAll(subDirTasks);
 
-            dir.Delete();
+            ;
 
             Console.WriteLine($"Deleted directory: {dir.FullName}");
killedBy: CleanTempAsync.Core.UnitTests.Helpers.CleanDirectoryHelperShouldAsync.Given_TempFolderPath_And_Clean_The_Directory_Asynchronously
